число = input() #Отримуємо число
цифра = len(число) #Рахуємо кількість символів
if цифра == 1:
    print("0000" + число) #Додаємо 4 нулі,якщо число одне
if цифра == 2:
    print("000" + число) #Додаємо 3 нулі
if цифра == 3:
    print("00" + число) #Додаємо 2 нулі
if цифра == 4:
    print("0" + число) #Додаємо 1 нуль
if цифра >= 5: print(число) #Якщо число 5 цифрове число,то нулі не додаємо
число = input()
цифра = len(число)
if цифра == 1:
    print("0000" + число)
if цифра == 2:
    print("000" + число)
if цифра == 3:
    print("00" + число)
if цифра == 4:
    print("0" + число)
if цифра >= 5:
    print(число)
число = input()
цифра = len(число)
if цифра == 1:
    print("0000" + число)
if цифра == 2:
    print("000" + число)
if цифра == 3:
    print("00" + число)
if цифра == 4:
    print("0" + число)
if цифра >= 5:
    print(число)
