k = int(input()) #номер уроку
if 1 <= k <= 7: #перевірка чи число відповідає умові
    time_saved = (k-1)*5 #обчислення зекономленого часу у хвилинах
    print(time_saved)
else:
    print("Помилка: число має бути від 1 до 7")
k = int(input()) #номер уроку
if 1 <= k <= 7: #перевірка чи число відповідає умові
    time_saved = (k-1)*5 #обчислення зекономленого часу у хвилинах
    print(time_saved)
else:
    print("Помилка: число має бути від 1 до 7")
k = int(input()) #номер уроку
if 1 <= k <= 7: #перевірка чи число відповідає умові
    time_saved = (k-1)*5 #обчислення зекономленого часу у хвилинах
    print(time_saved)
else:
    print("Помилка: число має бути від 1 до 7")
